# Unit Type Id Steradians Property

Source: https://www.revitapidocs.com/2026/824f8e98-c0a2-c2a8-9693-652074df0488.htm

---

| Unit Type Id Steradians Property |
| --- |

Steradians.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId Steradians { get; }
```

```
Public Shared ReadOnly Property Steradians As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ Steradians {
	ForgeTypeId^ get ();
}
```

```
static member Steradians : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

UnitTypeId Class Autodesk.Revit.DB Namespace